RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/inc/hc32f460_pwc.h
/*****************************************************************************
 * Copyright (C) 2020, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by HDSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 */
/******************************************************************************/
/** \file hc32f460_pwc.h
 **
 ** A detailed description is available at
 ** @link PwcGroup PWC description @endlink
 **
 **   - 2018-10-28  CDT  First version for Device Driver Library of PWC.
 **
 ******************************************************************************/
#ifndef __HC32F460_PWC_H__
#define __HC32F460_PWC_H__

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32_common.h"
#include "ddl_config.h"

#if (DDL_PWC_ENABLE == DDL_ON)


/* C binding of definitions if building with C++ compiler */
#ifdef __cplusplus
extern "C"
{
#endif

/**
 *******************************************************************************
 ** \defgroup PwcGroup Power Control(PWC)
 **
 ******************************************************************************/
//@{

/*******************************************************************************
 * Global type definitions ('typedef')
 ******************************************************************************/
/**
 *******************************************************************************
 ** \brief  The power down mode.
 **
 ******************************************************************************/
typedef enum en_pwc_powerdown_md
{
    PowerDownMd1                    = 0u,   ///< Power down mode 1.
    PowerDownMd2                    = 1u,   ///< Power down mode 2.
    PowerDownMd3                    = 2u,   ///< Power down mode 3.
    PowerDownMd4                    = 3u,   ///< Power down mode 4.
}en_pwc_powerdown_md_t;

/**
 *******************************************************************************
 ** \brief  The IO retain status under power down mode.
 **
 ******************************************************************************/
typedef enum en_pwc_iortn
{
    IoPwrDownRetain                 = 0u,   ///< Io keep under power down mode.
    IoPwrRstRetain                  = 1u,   ///< Io keep after power reset.
    IoHighImp                       = 2u,   ///< IO high impedance either power down or power reset.
}en_pwc_iortn_t;

/**
 *******************************************************************************
 ** \brief  The driver ability while different speed mode enter stop mode.
 **
 ******************************************************************************/
typedef enum en_pwc_stopdas
{
    StopHighspeed                    = 0u,   ///< The driver ability while high speed mode enter stop mode.
    StopUlowspeed                    = 3u,   ///< The driver ability while ultra_low speed mode enter stop mode.
}en_pwc_stopdas_t;

/**
 *******************************************************************************
 ** \brief  The dynamic power driver voltage select.
 **
 ******************************************************************************/
typedef enum en_pwc_rundrvs
{
    RunUHighspeed                  = 0u,   ///< The ultra_high speed.
    RunUlowspeed                   = 2u,   ///< The ultra_low speed.
    RunHighspeed                   = 3u,   ///< The high speed.
}en_pwc_rundrvs_t;

/**
 *******************************************************************************
 ** \brief  The dynamic power driver ability scaling.
 **
 ******************************************************************************/
typedef enum en_pwc_drvability_sca
{
    Ulowspeed                       = 8u,   ///< The ultra_low speed.
    HighSpeed                       = 15u,  ///< The high speed.
}en_pwc_drvability_sca_t;

/**
 *******************************************************************************
 ** \brief  The power down wake up time select.
 **
 ******************************************************************************/
typedef enum en_pwc_waketime_sel
{
    Vcap01                          = 0u,   ///< Wake up while vcap capacitance 2*0.1uf.
    Vcap0047                        = 1u,  ///< Wake up while vcap capacitance 2*0.047uf.
}en_pwc_waketime_sel_t;

/**
 *******************************************************************************
 ** \brief  The wait or not wait flash stable while stop mode awake.
 **
 ******************************************************************************/
typedef enum en_pwc_stop_flash_sel
{
    Wait                            = 0u,  ///< wait flash stable.
    NotWait                         = 1u,  ///< Not Wait flash stable.
}en_pwc_stop_flash_sel_t;

/**
 *******************************************************************************
 ** \brief  The clk value while stop mode awake.
 **
 ******************************************************************************/
typedef enum en_pwc_stop_clk_sel
{
    ClkFix                          = 0u,  ///< clock fix.
    ClkMrc                          = 1u,  ///< clock source is MRC, only ram code.
}en_pwc_stop_clk_sel_t;

/**
 *******************************************************************************
 ** \brief  The power down wake up event edge select.
 **
 ******************************************************************************/
typedef enum en_pwc_edge_sel
{
    EdgeFalling                      = 0u,  ///< Falling edge.
    EdgeRising                       = 1u,  ///< Rising edge.
}en_pwc_edge_sel_t;

/**
 *******************************************************************************
 ** \brief  The voltage detect edge select.
 **
 ******************************************************************************/
typedef enum en_pwc_pvdedge_sel
{
    OverVcc                         = 0u,  ///< PVD > VCC.
    BelowVcc                        = 1u,  ///< PVD < VCC.
}en_pwc_pvdedge_sel_t;

/**
 *******************************************************************************
 ** \brief  The flag of wake_up timer compare result.
 **
 ******************************************************************************/
typedef enum en_pwc_wkover_flag
{
    UnEqual                         = 0u,  ///< Timer value unequal with the wake_up compare value whitch set.
    Equal                           = 1u,  ///< Timer value equal with the wake_up compare value whitch set..
}en_pwc_wkover_flag_t;

/**
 *******************************************************************************
 ** \brief  The RAM operating mode.
 **
 ******************************************************************************/
typedef enum en_pwc_ram_op_md
{
    HighSpeedMd                     = 0x8043, ///< Work at high speed.
    UlowSpeedMd                     = 0x9062, ///< Work at ultra low speed.
}en_pwc_ram_op_md_t;

/**
 *******************************************************************************
 ** \brief  The wake up clock select.
 **
 ******************************************************************************/
typedef enum en_pwc_wkclk_sel
{
    Wk64hz                          = 0u,  ///< 64Hz.
    WkXtal32                        = 1u,  ///< Xtal32.
    WkLrc                           = 2u,  ///< Lrc.
}en_pwc_wkclk_sel_t;

/**
 *******************************************************************************
 ** \brief  The pvd digital filtering sampling clock select.
 **
 ******************************************************************************/
typedef enum en_pwc_pvdfiltclk_sel
{
    PvdLrc025                       = 0u,  ///< 0.25 LRC cycle.
    PvdLrc05                        = 1u,  ///< 0.5 LRC cycle.
    PvdLrc1                         = 2u,  ///< LRC 1 div.
    PvdLrc2                         = 3u,  ///< LRC 2 div.
}en_pwc_pvdfiltclk_sel_t;

/**
 *******************************************************************************
 ** \brief  The pvd2 level select.
 **
 ******************************************************************************/
typedef enum en_pwc_pvd2level_sel
{
    Pvd2Level0                     = 0u,  ///< 2.1V.while high_speed & ultra_low speed mode, 2.20V.while ultra_high speed mode.
    Pvd2Level1                     = 1u,  ///< 2.3V.while high_speed & ultra_low speed mode, 2.40V.while ultra_high speed mode.
    Pvd2Level2                     = 2u,  ///< 2.5V.while high_speed & ultra_low speed mode, 2.67V.while ultra_high speed mode.
    Pvd2Level3                     = 3u,  ///< 2.6V.while high_speed & ultra_low speed mode, 2.77V.while ultra_high speed mode.
    Pvd2Level4                     = 4u,  ///< 2.7V.while high_speed & ultra_low speed mode, 2.88V.while ultra_high speed mode.
    Pvd2Level5                     = 5u,  ///< 2.8V.while high_speed & ultra_low speed mode, 2.98V.while ultra_high speed mode.
    Pvd2Level6                     = 6u,  ///< 2.9V.while high_speed & ultra_low speed mode, 3.08V.while ultra_high speed mode.
    Pvd2Level7                     = 7u,  ///< 1.1V.while high_speed & ultra_low speed mode, 1.15V.while ultra_high speed mode.
}en_pwc_pvd2level_sel_t;

/**
 *******************************************************************************
 ** \brief  The pvd1 level select.
 **
 ******************************************************************************/
typedef enum en_pwc_pvd1level_sel
{
    Pvd1Level0                     = 0u,  ///< 2.0V.while high_speed & ultra_low speed mode, 2.09V.while ultra_high speed mode.
    Pvd1Level1                     = 1u,  ///< 2.1V.while high_speed & ultra_low speed mode, 2.20V.while ultra_high speed mode.
    Pvd1Level2                     = 2u,  ///< 2.3V.while high_speed & ultra_low speed mode, 2.40V.while ultra_high speed mode.
    Pvd1Level3                     = 3u,  ///< 2.5V.while high_speed & ultra_low speed mode, 2.67V.while ultra_high speed mode.
    Pvd1Level4                     = 4u,  ///< 2.6V.while high_speed & ultra_low speed mode, 2.77V.while ultra_high speed mode.
    Pvd1Level5                     = 5u,  ///< 2.7V.while high_speed & ultra_low speed mode, 2.88V.while ultra_high speed mode.
    Pvd1Level6                     = 6u,  ///< 2.8V.while high_speed & ultra_low speed mode, 2.98V.while ultra_high speed mode.
    Pvd1Level7                     = 7u,  ///< 2.9V.while high_speed & ultra_low speed mode, 3.08V.while ultra_high speed mode.
}en_pwc_pvd1level_sel_t;

/**
 *******************************************************************************
 ** \brief  The pvd interrupt select.
 **
 ******************************************************************************/
 typedef enum en_pwc_pvd_int_sel
{
    NonMskInt                       = 0u,  ///< Non-maskable Interrupt.
    MskInt                          = 1u,  ///< Maskable Interrupt.
}en_pwc_pvd_int_sel_t;

/**
 *******************************************************************************
 ** \brief  The handle of pvd mode.
 **
 ******************************************************************************/
 typedef enum en_pwc_pvd_md
{
    PvdInt                          = 0u,  ///< The handle of pvd is interrupt.
    PvdReset                        = 1u,  ///< The handle of pvd is reset.
}en_pwc_pvd_md_t;

/**
 *******************************************************************************
 ** \brief  The unit of pvd detect.
 **
 ******************************************************************************/
 typedef enum en_pwc_pvd
{
    PvdU1                        = 0u,      ///< The uint1 of pvd detect.
    PvdU2                        = 1u,      ///< The unit2 of pvd detect.
}en_pwc_pvd_t;

/**
 *******************************************************************************
 ** \brief  The power mode  configuration.
 **
 ******************************************************************************/
typedef struct stc_pwc_pwr_mode_cfg
{
    en_pwc_powerdown_md_t   enPwrDownMd;    ///< Power down mode.
    en_functional_state_t   enRLdo;         ///< Enable or disable RLDO.
    en_functional_state_t   enRetSram;      ///< Enable or disable Ret_Sram.
    en_pwc_iortn_t          enIoRetain;     ///< IO retain.
    en_pwc_waketime_sel_t   enPwrDWkupTm;   ///< The power down wake up time select.
}stc_pwc_pwr_mode_cfg_t;

/**
 *******************************************************************************
 ** \brief  The stop mode configuration.
 **
 ******************************************************************************/
typedef struct stc_pwc_stop_mode_cfg
{
    en_pwc_stopdas_t        enStpDrvAbi;    ///< Driver ability while enter stop mode.
    en_pwc_stop_flash_sel_t enStopFlash;    ///< Flash mode while stop mode awake.
    en_pwc_stop_clk_sel_t   enStopClk;      ///< Clock value while stop mode awake.
    en_functional_state_t   enPll;          ///< Whether the PLL enable or disable while enter stop mode.
}stc_pwc_stop_mode_cfg_t;

/**
 *******************************************************************************
 ** \brief  The power down wake_up timer control.
 **
 ******************************************************************************/
typedef struct stc_pwc_wktm_ctl
{
    uint16_t                u16WktmCmp;     ///< The wake_up timer compare value.
    en_pwc_wkover_flag_t    enWkOverFlag;   ///< The flag of compare result.
    en_pwc_wkclk_sel_t      enWkclk;        ///< The clock of wake_up timer.
    en_functional_state_t   enWktmEn;       ///< Enable or disable wake_up timer.
}stc_pwc_wktm_ctl_t;

/**
 *******************************************************************************
 ** \brief  The pvd control.
 **
 ******************************************************************************/
typedef struct stc_pwc_pvd_ctl
{
    en_functional_state_t   enPvdIREn;      ///< Enable or disable pvd interrupt(reset).
    en_pwc_pvd_md_t         enPvdMode;      ///< The handle of pvd is interrupt or reset.
    en_functional_state_t   enPvdCmpOutEn;  ///< Enable or disable pvd output compare result .
}stc_pwc_pvd_ctl_t;

/**
 *******************************************************************************
 ** \brief  The power down wake_up event configuration.
 **
 ******************************************************************************/
typedef struct stc_pwc_pvd_cfg
{
    stc_pwc_pvd_ctl_t       stcPvd1Ctl;     ///< Pvd1 control configuration.
    stc_pwc_pvd_ctl_t       stcPvd2Ctl;     ///< Pvd2 control configuration.
    en_functional_state_t   enPvd1FilterEn; ///< Pvd1 filtering enable or disable.
    en_functional_state_t   enPvd2FilterEn; ///< Pvd2 filtering enable or disable.
    en_pwc_pvdfiltclk_sel_t enPvd1Filtclk;  ///< Pvd1 filtering sampling clock.
    en_pwc_pvdfiltclk_sel_t enPvd2Filtclk;  ///< Pvd2 filtering sampling clock.
    en_pwc_pvd1level_sel_t  enPvd1Level;    ///< Pvd1 voltage.
    en_pwc_pvd2level_sel_t  enPvd2Level;    ///< Pvd2 voltage.
    en_pwc_pvd_int_sel_t    enPvd1Int;      ///< Pvd1 interrupt.
    en_pwc_pvd_int_sel_t    enPvd2Int;      ///< Pvd2 interrupt.
}stc_pwc_pvd_cfg_t;

