RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/inc/hc32f460_pwc.h
/*******************************************************************************
 * Global pre-processor symbols/macros ('#define')
 ******************************************************************************/
#define PWC_PDWKEN0_WKUP00          ((uint8_t)0x01)
#define PWC_PDWKEN0_WKUP01          ((uint8_t)0x02)
#define PWC_PDWKEN0_WKUP02          ((uint8_t)0x04)
#define PWC_PDWKEN0_WKUP03          ((uint8_t)0x08)
#define PWC_PDWKEN0_WKUP10          ((uint8_t)0x10)
#define PWC_PDWKEN0_WKUP11          ((uint8_t)0x20)
#define PWC_PDWKEN0_WKUP12          ((uint8_t)0x40)
#define PWC_PDWKEN0_WKUP13          ((uint8_t)0x80)

#define PWC_PDWKEN1_WKUP20          ((uint8_t)0x01)
#define PWC_PDWKEN1_WKUP21          ((uint8_t)0x02)
#define PWC_PDWKEN1_WKUP22          ((uint8_t)0x04)
#define PWC_PDWKEN1_WKUP23          ((uint8_t)0x08)
#define PWC_PDWKEN1_WKUP30          ((uint8_t)0x10)
#define PWC_PDWKEN1_WKUP31          ((uint8_t)0x20)
#define PWC_PDWKEN1_WKUP32          ((uint8_t)0x40)
#define PWC_PDWKEN1_WKUP33          ((uint8_t)0x80)

#define PWC_PDWKEN2_PVD1            ((uint8_t)0x01)
#define PWC_PDWKEN2_PVD2            ((uint8_t)0x02)
#define PWC_PDWKEN2_NMI             ((uint8_t)0x04)
#define PWC_PDWKEN2_RTCPRD          ((uint8_t)0x10)
#define PWC_PDWKEN2_RTCAL           ((uint8_t)0x20)
#define PWC_PDWKEN2_WKTM            ((uint8_t)0x80)

#define PWC_PDWKUP_EDGE_WKP0        ((uint8_t)0x01)
#define PWC_PDWKUP_EDGE_WKP1        ((uint8_t)0x02)
#define PWC_PDWKUP_EDGE_WKP2        ((uint8_t)0x04)
#define PWC_PDWKUP_EDGE_WKP3        ((uint8_t)0x08)
#define PWC_PDWKUP_EDGE_PVD1        ((uint8_t)0x10)
#define PWC_PDWKUP_EDGE_PVD2        ((uint8_t)0x20)
#define PWC_PDWKUP_EDGE_NMI         ((uint8_t)0x40)

#define PWC_RAMPWRDOWN_SRAM1        ((uint32_t)0x00000001)
#define PWC_RAMPWRDOWN_SRAM2        ((uint32_t)0x00000002)
#define PWC_RAMPWRDOWN_SRAM3        ((uint32_t)0x00000004)
#define PWC_RAMPWRDOWN_SRAMH        ((uint32_t)0x00000008)
#define PWC_RAMPWRDOWN_USBFS        ((uint32_t)0x00000010)
#define PWC_RAMPWRDOWN_SDIOC0       ((uint32_t)0x00000020)
#define PWC_RAMPWRDOWN_SDIOC1       ((uint32_t)0x00000040)
#define PWC_RAMPWRDOWN_CAN          ((uint32_t)0x00000080)
#define PWC_RAMPWRDOWN_CACHE        ((uint32_t)0x00000100)
#define PWC_RAMPWRDOWN_FULL         ((uint32_t)0x000001FF)

#define PWC_STOPWKUPEN_EIRQ0        ((uint32_t)0x00000001)
#define PWC_STOPWKUPEN_EIRQ1        ((uint32_t)0x00000002)
#define PWC_STOPWKUPEN_EIRQ2        ((uint32_t)0x00000004)
#define PWC_STOPWKUPEN_EIRQ3        ((uint32_t)0x00000008)
#define PWC_STOPWKUPEN_EIRQ4        ((uint32_t)0x00000010)
#define PWC_STOPWKUPEN_EIRQ5        ((uint32_t)0x00000020)
#define PWC_STOPWKUPEN_EIRQ6        ((uint32_t)0x00000040)
#define PWC_STOPWKUPEN_EIRQ7        ((uint32_t)0x00000080)
#define PWC_STOPWKUPEN_EIRQ8        ((uint32_t)0x00000100)
#define PWC_STOPWKUPEN_EIRQ9        ((uint32_t)0x00000200)
#define PWC_STOPWKUPEN_EIRQ10       ((uint32_t)0x00000400)
#define PWC_STOPWKUPEN_EIRQ11       ((uint32_t)0x00000800)
#define PWC_STOPWKUPEN_EIRQ12       ((uint32_t)0x00001000)
#define PWC_STOPWKUPEN_EIRQ13       ((uint32_t)0x00002000)
#define PWC_STOPWKUPEN_EIRQ14       ((uint32_t)0x00004000)
#define PWC_STOPWKUPEN_EIRQ15       ((uint32_t)0x00008000)
#define PWC_STOPWKUPEN_SWDT         ((uint32_t)0x00010000)
#define PWC_STOPWKUPEN_VDU1         ((uint32_t)0x00020000)
#define PWC_STOPWKUPEN_VDU2         ((uint32_t)0x00040000)
#define PWC_STOPWKUPEN_CMPI0        ((uint32_t)0x00080000)
#define PWC_STOPWKUPEN_WKTM         ((uint32_t)0x00100000)
#define PWC_STOPWKUPEN_RTCAL        ((uint32_t)0x00200000)
#define PWC_STOPWKUPEN_RTCPRD       ((uint32_t)0x00400000)
#define PWC_STOPWKUPEN_TMR0         ((uint32_t)0x00800000)
#define PWC_STOPWKUPEN_USARTRXD     ((uint32_t)0x02000000)

#define PWC_PTWK0_WKUPFLAG          ((uint8_t)0x01)
#define PWC_PTWK1_WKUPFLAG          ((uint8_t)0x02)
#define PWC_PTWK2_WKUPFLAG          ((uint8_t)0x04)
#define PWC_PTWK3_WKUPFLAG          ((uint8_t)0x08)
#define PWC_PVD1_WKUPFLAG           ((uint8_t)0x10)
#define PWC_PVD2_WKUPFLAG           ((uint8_t)0x20)
#define PWC_NMI_WKUPFLAG            ((uint8_t)0x40)

#define PWC_RTCPRD_WKUPFALG         ((uint8_t)0x10)
#define PWC_RTCAL_WKUPFLAG          ((uint8_t)0x20)
#define PWC_WKTM_WKUPFLAG           ((uint8_t)0x80)

#define PWC_WKTMCMP_MSK             ((uint16_t)0x0FFF)

#define PWC_FCG0_PERIPH_SRAMH       ((uint32_t)0x00000001)
#define PWC_FCG0_PERIPH_SRAM12      ((uint32_t)0x00000010)
#define PWC_FCG0_PERIPH_SRAM3       ((uint32_t)0x00000100)
#define PWC_FCG0_PERIPH_SRAMRET     ((uint32_t)0x00000400)
#define PWC_FCG0_PERIPH_DMA1        ((uint32_t)0x00004000)
#define PWC_FCG0_PERIPH_DMA2        ((uint32_t)0x00008000)
#define PWC_FCG0_PERIPH_FCM         ((uint32_t)0x00010000)
#define PWC_FCG0_PERIPH_AOS         ((uint32_t)0x00020000)
#define PWC_FCG0_PERIPH_AES         ((uint32_t)0x00100000)
#define PWC_FCG0_PERIPH_HASH        ((uint32_t)0x00200000)
#define PWC_FCG0_PERIPH_TRNG        ((uint32_t)0x00400000)
#define PWC_FCG0_PERIPH_CRC         ((uint32_t)0x00800000)
#define PWC_FCG0_PERIPH_DCU1        ((uint32_t)0x01000000)
#define PWC_FCG0_PERIPH_DCU2        ((uint32_t)0x02000000)
#define PWC_FCG0_PERIPH_DCU3        ((uint32_t)0x04000000)
#define PWC_FCG0_PERIPH_DCU4        ((uint32_t)0x08000000)
#define PWC_FCG0_PERIPH_KEY         ((uint32_t)0x80000000)


#define PWC_FCG1_PERIPH_CAN         ((uint32_t)0x00000001)
#define PWC_FCG1_PERIPH_QSPI        ((uint32_t)0x00000008)
#define PWC_FCG1_PERIPH_I2C1        ((uint32_t)0x00000010)
#define PWC_FCG1_PERIPH_I2C2        ((uint32_t)0x00000020)
#define PWC_FCG1_PERIPH_I2C3        ((uint32_t)0x00000040)
#define PWC_FCG1_PERIPH_USBFS       ((uint32_t)0x00000100)
#define PWC_FCG1_PERIPH_SDIOC1      ((uint32_t)0x00000400)
#define PWC_FCG1_PERIPH_SDIOC2      ((uint32_t)0x00000800)
#define PWC_FCG1_PERIPH_I2S1        ((uint32_t)0x00001000)
#define PWC_FCG1_PERIPH_I2S2        ((uint32_t)0x00002000)
#define PWC_FCG1_PERIPH_I2S3        ((uint32_t)0x00004000)
#define PWC_FCG1_PERIPH_I2S4        ((uint32_t)0x00008000)
#define PWC_FCG1_PERIPH_SPI1        ((uint32_t)0x00010000)
#define PWC_FCG1_PERIPH_SPI2        ((uint32_t)0x00020000)
#define PWC_FCG1_PERIPH_SPI3        ((uint32_t)0x00040000)
#define PWC_FCG1_PERIPH_SPI4        ((uint32_t)0x00080000)
#define PWC_FCG1_PERIPH_USART1      ((uint32_t)0x01000000)
#define PWC_FCG1_PERIPH_USART2      ((uint32_t)0x02000000)
#define PWC_FCG1_PERIPH_USART3      ((uint32_t)0x04000000)
#define PWC_FCG1_PERIPH_USART4      ((uint32_t)0x08000000)

