RT-Thread/rt-thread/bsp/hc32f460/Libraries/HC32F460_StdPeriph_Driver/inc/hc32f460_pwc.h
#define PWC_FCG2_PERIPH_TIM01       ((uint32_t)0x00000001)
#define PWC_FCG2_PERIPH_TIM02       ((uint32_t)0x00000002)
#define PWC_FCG2_PERIPH_TIMA1       ((uint32_t)0x00000004)
#define PWC_FCG2_PERIPH_TIMA2       ((uint32_t)0x00000008)
#define PWC_FCG2_PERIPH_TIMA3       ((uint32_t)0x00000010)
#define PWC_FCG2_PERIPH_TIMA4       ((uint32_t)0x00000020)
#define PWC_FCG2_PERIPH_TIMA5       ((uint32_t)0x00000040)
#define PWC_FCG2_PERIPH_TIMA6       ((uint32_t)0x00000080)
#define PWC_FCG2_PERIPH_TIM41       ((uint32_t)0x00000100)
#define PWC_FCG2_PERIPH_TIM42       ((uint32_t)0x00000200)
#define PWC_FCG2_PERIPH_TIM43       ((uint32_t)0x00000400)
#define PWC_FCG2_PERIPH_EMB         ((uint32_t)0x00008000)
#define PWC_FCG2_PERIPH_TIM61       ((uint32_t)0x00010000)
#define PWC_FCG2_PERIPH_TIM62       ((uint32_t)0x00020000)
#define PWC_FCG2_PERIPH_TIM63       ((uint32_t)0x00040000)

#define PWC_FCG3_PERIPH_ADC1        ((uint32_t)0x00000001)
#define PWC_FCG3_PERIPH_ADC2        ((uint32_t)0x00000002)
#define PWC_FCG3_PERIPH_CMP         ((uint32_t)0x00000100)
#define PWC_FCG3_PERIPH_OTS         ((uint32_t)0x00001000)

/*******************************************************************************
 * Global variable definitions ('extern')
 ******************************************************************************/

/*******************************************************************************
 * Global function prototypes (definition in C source)
 ******************************************************************************/
void PWC_PowerModeCfg(const stc_pwc_pwr_mode_cfg_t* pstcPwrMdCfg);
void PWC_EnterPowerDownMd(void);

void PWC_PdWakeup0Cmd(uint32_t u32Wkup0Event, en_functional_state_t enNewState);
void PWC_PdWakeup1Cmd(uint32_t u32Wkup1Event, en_functional_state_t enNewState);
void PWC_PdWakeup2Cmd(uint32_t u32Wkup2Event, en_functional_state_t enNewState);
void PWC_PdWakeupEvtEdgeCfg(uint8_t u8WkupEvent, en_pwc_edge_sel_t enEdge);

en_flag_status_t PWC_GetWakeup0Flag(uint8_t u8WkupFlag);
en_flag_status_t PWC_GetWakeup1Flag(uint8_t u8WkupFlag);
void PWC_ClearWakeup0Flag(uint8_t u8WkupFlag);
void PWC_ClearWakeup1Flag(uint8_t u8WkupFlag);
void PWC_PwrMonitorCmd(en_functional_state_t enNewState);

void PWC_Fcg0PeriphClockCmd(uint32_t u32Fcg0Periph, en_functional_state_t enNewState);
void PWC_Fcg1PeriphClockCmd(uint32_t u32Fcg1Periph, en_functional_state_t enNewState);
void PWC_Fcg2PeriphClockCmd(uint32_t u32Fcg2Periph, en_functional_state_t enNewState);
void PWC_Fcg3PeriphClockCmd(uint32_t u32Fcg3Periph, en_functional_state_t enNewState);

en_result_t PWC_StopModeCfg(const stc_pwc_stop_mode_cfg_t*  pstcStpMdCfg);
void PWC_StopWkupCmd(uint32_t u32Wkup0Event, en_functional_state_t enNewState);

void PWC_EnterStopMd(void);
void PWC_EnterSleepMd(void);

void PWC_Xtal32CsCmd(en_functional_state_t enNewState);
void PWC_HrcPwrCmd(en_functional_state_t enNewState);
void PWC_PllPwrCmd(en_functional_state_t enNewState);
void PWC_RamPwrdownCmd(uint32_t u32RamCtlBit, en_functional_state_t enNewState);
void PWC_RamOpMdConfig(en_pwc_ram_op_md_t enRamOpMd);

void PWC_WktmControl(const stc_pwc_wktm_ctl_t* pstcWktmCtl);

void PWC_PvdCfg(const stc_pwc_pvd_cfg_t* pstcPvdCfg);
void PWC_Pvd1Cmd(en_functional_state_t enNewState);
void PWC_Pvd2Cmd(en_functional_state_t enNewState);
void PWC_ExVccCmd(en_functional_state_t enNewState);
void PWC_ClearPvdFlag(en_pwc_pvd_t enPvd);
en_flag_status_t PWC_GetPvdFlag(en_pwc_pvd_t enPvd);
en_flag_status_t PWC_GetPvdStatus(en_pwc_pvd_t enPvd);

void PWC_enNvicBackup(void);
void PWC_enNvicRecover(void);
void PWC_ClkBackup(void);
void PWC_ClkRecover(void);
void PWC_IrqClkBackup(void);
void PWC_IrqClkRecover(void);

en_result_t PWC_HS2LS(void);
en_result_t PWC_LS2HS(void);
en_result_t PWC_HS2HP(void);
en_result_t PWC_HP2HS(void);
en_result_t PWC_LS2HP(void);
en_result_t PWC_HP2LS(void);

//@} // PwcGroup

#ifdef __cplusplus
}
#endif

#endif /* DDL_PWC_ENABLE */

#endif /* __HC32F460_PWC_H__ */

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
